package com.example.pizzarecipes;

public class Utils {

    public static final String  PIZZA_1_TITLE="Пицца “Вальтеллина” (Valtellina).";
    public static final String PIZZA_1_DESCRIPTION = "Томатный соус, моцарелла, бресаола, хлопья пармезана и ракета.";
    public static final String PIZZA_1_RECIPE ="Ингредиенты для «Тесто для тонкой пиццы \"Как Пицца Хат\"»:\n" +
            "Молоко — 200 мл \n" +
            "Мука пшеничная / Мука — 330 г \n" +
            "Масло оливковое — 2 ст. л. \n" +
            "Дрожжи (сухие) — 7 г \n" +
            "Соль — 0,5 ч. л. \n" +
            "Сахар — 2 ч. л. \n" +
            "Время приготовления: 80 минут\n" +
            "Количество порций: 6\n,    В теплом молоке растворить сахар и дрожжи и дать постоять 10 минут.Соль просеять с мукой, добавить жидкую смесь, в конце влить масло. Месить 5 минут до получения гладкого теста.\n" +
            "Смазать маслом емкость для подъема, тесто скатать шаром и положить на полчаса в емкости в теплое место. Накрыть емкость пленкой.\n" +
            "\n" +
            "Готовое тесто разделить пополам и растянуть руками в тонких 2 круга (можно раскатать). Духовку нагреть до 250-270 С – чем выше температура, тем более хрустящей будет основа. Противень тоже нагреть.\n" +
            "Вынуть противень, смазать кисточкой оливковым маслом (чтоб донышко хрустело после выпечки). Выложить пиццевый полуфабрикат на противень, включить (если есть) в духовке вентилятор. Выпекать до золотистого цвета бортиков или как любите. У меня ушло 15 минут. ";

    public static final String  PIZZA_2_TITLE="Пицца с горгонзолой (Gorgonzola). ";
    public static final String PIZZA_2_DESCRIPTION = "Томатный соус, моцарелла, горгонзола, оливки.";
    public static final String PIZZA_2_RECIPE ="Сыр твердый — 200 г \n" +
            "Колбаса (салями) — 250 г \n" +
            "Помидор — 1-2 шт \n" +
            "Лук репчатый — 1 шт \n" +
            "Перец болгарский — 1/2 шт \n" +
            "Майонез (легкий) — 2-3 ст. л. \n" +
            "Майоран (сушеный) \n" +
            "Тесто дрожжевое \n" +
            "Зелень \n" +
            "Время приготовления: 40 минут\n" +
            "Количество порций: 6   Тесто разравниваем по форме руками... ооооооочень тонко!!!\n" +
            "\n" +
            "ТЕСТО:\n" +
            "Кому лень заходить по ссылке, напишу рецепт здесь.\n" +
            "- Простокваша (или кефир)- 0,5 л\n" +
            "- Дрожжи - 2 ч. л. (развести в 1/2 стак. теплой подслащенной воды (1 ч. л. сахара))\n" +
            "- Масло растительное - 1/2 стак.\n" +
            "- Мука - до мягкого теста\n" +
            "Этого теста хватит на 2-3 пиццы в зависимости от диаметра формы, у меня d=32 см. Смазываем майонезом.\n" +
            "Посыпаем сушеным майораном. Сыр трем на терке. И вот... наконец, чудеса...\n" +
            "После майонеза и майорана наносим толстенный слой сыра...Режем дольками помидор.Так же режем салями.\n"+
            "Выкладываем помидоры на расстоянии друг от друга.Выкладываем по принципу чешуи в порядке \n"+
            "салями-помидор-лук. Очень важно, чтобы помидор был поверх лука. Посыпаем мелко нарезанным болгарским перцем.\n"+
            "Затем вторая порция сыра.Выпекаем в разогретом духовом шкафу 25-30 минут.";

    public static final String  PIZZA_3_TITLE="Пицца “Кальцоне” (Calzone).";
    public static final String PIZZA_3_DESCRIPTION = "Томатный соус, моцарелла, ветчина, грибы, артишоки, анчоусы и орегано.";
    public static final String PIZZA_3_RECIPE ="Батон (белый) — 7 ломт. \n" +
            "Молоко — 3/4 стак. \n" +
            "Яйцо куриное (отборное) — 1 шт \n" +
            "Мука пшеничная / Мука (примерно) — 1 ст. л. \n" +
            "Масло растительное — 3 ст. л. \n" +
            "Помидор (свежий) — 2 шт \n" +
            "Соль \n" +
            "Колбаса — 200 г \n" +
            "Сыр твердый (который хорошо плавится, у меня «Российский») — 150 г \n" +
            "Специи (перец черный молотый, базилик) — по вкусу \n"+
            "Готовлю на сковороде с антипригарным покрытием диам. 30 см. \n"+
    "Для начинки я брала докторскую колбасу, варенную сосиску, помидоры и сыр. \n"+
    "Начинку нужно подготовить заранее, т. к. основа для пиццы жарится быстро. \n"+
            "сыр натерла на терке.Сколько нужно хлеба для теста можно «измерить», выложив сковороду ломтиками хлеба.\n"+
            "От качества хлеба будет зависеть результат основы для пиццы. Рекомендую использовать белый батон из муки в/с.\n" +
            "Приготовление теста.\n" +
            "Налить молоко в глубокую тарелку, обмакнуть каждый ломтик хлеба с 2-х сторон и оставить на 10 минут пропитаться.\n"+
            "С помидоров снять кожицу.\n"+
            "Нарезать на небольшие кусочки, добавить любимые специи (у меня черный молотый перец, базилик)\n"+
            "и тушить на сковороде с 1 ст. л. масла до испарения жидкости, постоянно помешивая, \n"+
            "на среднем огне. Должен получиться томатный соус. Добавляем соль. Это будет вместо кетчупа.\n"+
            "Хлеб разминаем до однородной массы удобным для вас способом. Я делаю с помощью толкушки.\n"+
            "Добавляем соль, яйцо, муку, все перемешиваем. Тесто должно быть очень густое.\n"+
            "Если получилось жидкое, то добавьте еще немного муки. \n"+
            "Сковороду разогреваем на большом огне, наливаем растительное масло,\n"+
            "выкладываем (не выливаем, а именно ВЫКЛАДЫВАЕМ) тесто тонким слоем (примерно 1 см),\n"+
        "разравниваем, закрываем крышкой, и жарим на среднем (!) огне, чтобы \n"+
            "получилась румяная корочка снизу. Примерно минут 5.\n "+
            "Аккуратно переворачиваем на сковороде основу для пиццы, убираем сковородку с огня. \n"+
            "Выкладываем на основу приготовленный томатный соус, \n"+
            "Колбасу, щедро посыпаем сыром. Здесь нельзя экономить на сыре. Надо, чтобы начинка «схватилась».\n" +
            "Ставим сковороду с пиццей на маленький огонь, накрываем крышкой и жарим до готовности теста. \n"+
            "Снимаем с огня, открываем крышку и даем пицце немного остыть прямо в сковороде. ";

    public static final String  PIZZA_4_TITLE="Пицца с соусом песто (Pizza al Pesto). ";
    public static final String PIZZA_4_DESCRIPTION = "Помидоры, моцарелла, генуэзское песто, кедровые орехи и оливки.";
    public static final String PIZZA_4_RECIPE ="Recept";

    public static final String  PIZZA_5_TITLE="Средиземноморская пицца (Mediterranea).";
    public static final String PIZZA_5_DESCRIPTION = "Томатный соус, моцарелла, помидоры черри и перец.";
    public static final String PIZZA_5_RECIPE ="Recept";

    public static final String  PIZZA_6_TITLE="Пицца “Ортолана” (Ortolana).";
    public static final String PIZZA_6_DESCRIPTION = "Томатный соус, моцарелла и ассорти из овощей";
    public static final String PIZZA_6_RECIPE ="Recept";

    public static final String  PIZZA_7_TITLE="Пицца Дьавола (Diavola). ";
    public static final String PIZZA_7_DESCRIPTION = "Томатный соус, моцарелла, острая салями и перец чили.";
    public static final String PIZZA_7_RECIPE ="Recept";

    public static final String  PIZZA_8_TITLE="Деревенская пицца (Rustica).";
    public static final String PIZZA_8_DESCRIPTION = "Томатный соус, моцарелла, сыр горгонзола и баклажаны.";
    public static final String PIZZA_8_RECIPE ="Recept";

    public static final String  PIZZA_9_TITLE="Пицца “Каприччиоза” (Capricciosa).";
    public static final String PIZZA_9_DESCRIPTION = "Томатный соус, моцарелла, ветчина, артишоки, грибы и оливки.";
    public static final String PIZZA_9_RECIPE ="Recept";

    public static final String  PIZZA_10_TITLE="Пицца со шпинатом и рикоттой(Ricotta e Spinaci).";
    public static final String PIZZA_10_DESCRIPTION = "Томатный соус, моцарелла, сыр рикотта и шпинат.";
    public static final String PIZZA_10_RECIPE ="Recept";

    public static final String  PIZZA_11_TITLE="Вегетарианская пицца (Vegetariana).";
    public static final String PIZZA_11_DESCRIPTION = "Томатный соус, моцарелла и различные овощи.";
    public static final String PIZZA_11_RECIPE ="Recept";

    public static final String  PIZZA_12_TITLE="Францисканская пицца (Francescana).";
    public static final String PIZZA_12_DESCRIPTION = "Томатный соус, моцарелла, porcino грибами, ветчиной и пармезаном.";
    public static final String PIZZA_12_RECIPE ="Recept";

   /* public static final String  PIZZA_15_TITLE="Пицца “Валле-д’Аоста” (Valdostana). ";
    public static final String PIZZA_15_DESCRIPTION = "Томатный соус, моцарелла, сыр фонтина и бекон.";
    public static final String PIZZA_15_RECIPE ="Recept";
*/
    public static final String  PIZZA_14_TITLE=" Грибная пицца (Funghi).";
    public static final String PIZZA_14_DESCRIPTION = "Томатный соус, моцарелла, грибы, петрушка и оливковое масло.";
    public static final String PIZZA_14_RECIPE ="Recept";



}
